{
  "title":"WELCOME TO FAIRNESS THROUGH AWARENESS",
  "subTitle":"LETS BRING AWARENESS ABOUT H1B GREEN CARD BACKLOGS",
  "paragraph1":"This issue is impacting more than 1.5 million high-skilled immigrants who are currently stuck in decades long green card backlog. These high-skilled immigrants, many with advanced degrees in STEM, have followed all the laws, paid taxes and contributed significantly to the United States, but are victims of 50 year old immigration laws. Discriminatory per country caps in allocation of immigrant visas have severely impacted their lives, careers, and families. In spite of having approved immigrant petitions, these immigrants are being subjected to at least a 70 year wait just to adjust their status as legal permanent residents",
  "paragraph2":"I cannot start my own business and create American jobs. One job loss during this 70 years wait, would force me to liquidate all my assets and investments here, and leave the country within 60 days. Children who were born here, and are American Citizens, will also have to leave along with their parents and their future will be impacted forever. America will not only lose investments but will also lose skills and talent it helped develop. This will have a far reaching impact on the United States economy, American families and businesses. Foreign born children of these immigrants may need to self-deport, if they do not get permanent residency prior to turning 21 years of age.",
  "paragraph3":"I sincerely request you to take this into consideration, please bring awareness about our green card backlog and socio-economic struggle we are going through. To clear the backlog, Congress can take multiple actions such as eliminating per country caps from employment based immigrant visas, recapture wasted visas, remove counting of dependents of primary applicant from employment based category within the same pool, or temporarily increase proportion of employment based green cards. Congress already has a huge consensus on some of these proposals and 300+ cosponsors for the bills such as HR-392 reflects such bi-partisan support.",
  "paragraph4":"My family and I consider United States as our home, and have built deep economic and emotional ties with this great nation of ours! We are desperately waiting for Congress to act and provide relief to contributing residents like me, so that we can leverage the skills we gained here to fix the issues we see here and build on opportunities to further reinforce the position of the United States as that shining city upon the hill!",
  "note":"Thanks for your time and consideration in reading my letter, also i would appreciate if you can keep my personal information confidential.",
  "subject":"Letter to the Editor"
}
